mat1 = matrix(c(1,2,3,4,5)) #4행 1열.
mat1

mat2 <- matrix(c(1,2,3,4), nrow=2) #2행2열. 열우선 생성
mat2
  #     [,1] [,2]
  # [1,]    1    3
  # [2,]    2    4

mat3 <- matrix(c(1,2,3,4), nrow=2, byrow=T) #2행2열. 행우선 생성
  #     [,1] [,2]
  # [1,]    1    2
  # [2,]    3    4

mat4 <- matrix(c(1,2,3,4), byrow=T) #1행4열. 행우선 생성
  #      [,1]
  # [1,]    1
  # [2,]    2
  # [3,]    3
  # [4,]    4

#값을 조회하기
#1열의 값 조회
mat3[,1]  #1 3
#1행의 값 조회
mat3[1,]  #1 2
#2행 2열 값 조회
mat3[2,2] #4

# Q. mat5 변수에 1-9까지 숫자를 3행 3열 매트릭스 생성
mat5 <- matrix(1:9, nrow=3, byrow=T)
mat5

#행추가 : rbind()
mat5 <- rbind(mat5, c(11,12,13)) #4행 3열
mat5
  #      [,1] [,2] [,3]
  # [1,]    1    2    3
  # [2,]    4    5    6
  # [3,]    7    8    9
  # [4,]   11   12   13

#열추가 : cbind()
mat5 <- cbind(mat5, c(10,11,12,13)) #4행 4열
mat5
  #     [,1] [,2] [,3] [,4]
  # [1,]    1    2    3   10
  # [2,]    4    5    6   11
  # [3,]    7    8    9   12
  # [4,]   11   12   13   13

mat5 <- rbind(mat5, c(11,12,13)) #Warning: 개수 동일해야함
mat5

# a,b,c,d 4개 문자열을 2행2열 matric 객체로 생성
mat6 <- matrix(c('a','b','c','d'), nrow=2, byrow=T)
mat6

# e,f 문자를 열로 추가하기
mat6 <- cbind(mat6, c('e', 'f')) #2행 3열
mat6
  #    [,1] [,2] [,3]
  #[1,] "a"  "b"  "e" 
  #[2,] "c"  "d"  "f" 

#colnames() 컬럼 이름 설정
colnames(mat6) <- c('First','Second','Third')
mat6
  #    First Second Third
  #[1,] "a"   "b"    "e"  
  #[2,] "c"   "d"    "f"  

#rownames() 컬럼 이름 설정
rownames(mat6) <- c("one", "two")
mat6
  #   First Second Third
  #one "a"   "b"    "e"  
  #two "c"   "d"    "f"  

#nrow() 행 개수 리턴
nrow(mat6) #2
#ncol() 열 개수 리턴
ncol(mat6) #3

#개수확인
length(mat6) #6
#요소 자료형
mode(mat6) #"character"

### matrix 연산
a <- matrix(1:3, 3,3)
a
  #     [,1] [,2] [,3]
  #[1,]    1    1    1
  #[2,]    2    2    2
  #[3,]    3    3    3
b <- matrix(4:6, 3,3)
b
  #      [,1] [,2] [,3]
  # [1,]    4    4    4
  # [2,]    5    5    5
  # [3,]    6    6    6

#행렬 성분의 곱
a*b
  #      [,1] [,2] [,3]
  # [1,]    4    4    4
  # [2,]   10   10   10
  # [3,]   18   18   18

# 행렬의 곱
a%*%b 
  #      [,1] [,2] [,3] :: a의 각 행 * b의 각 열
  # [1,]   15   15   15 : 1*4+1*5+1*6
  # [2,]   30   30   30 : 2*4+2*5+2*6
  # [3,]   45   45   45 : 3*4+3*5+3*6

c <- matrix(c(1,-2,4,-1,3,-5,2,7,5), 3,3)
c
  #      [,1] [,2] [,3]
  # [1,]    1   -1    2
  # [2,]   -2    3    7
  # [3,]    4   -5    5

t(c) #전치행렬 : 행과 열을 바꿈
  #      [,1] [,2] [,3]
  # [1,]    1   -2    4
  # [2,]   -1    3   -5
  # [3,]    2    7    5

c1 = solve(c) #역행렬 : 행렬의 곱의 결과가 단위행렬인 행렬
c1
  #       [,1]   [,2]   [,3]
  # [1,]  6.25 -0.625 -1.625
  # [2,]  4.75 -0.375 -1.375
  # [3,] -0.25  0.125  0.125

c %*% c1 # 단위행렬 : 대각선=1, 나머지=0
  #      [,1] [,2] [,3]
  # [1,]    1    0    0
  # [2,]    0    1    0
  # [3,]    0    0    1

#c matrix의 열별 합계
colSums(c) #3 -3 14
# 행별합계
rowSums(c) #2 8 4

x <- rep(1:4, 4)
x
x[9] = NA
m <- matrix(x, nrow=4)
m
  #      [,1] [,2] [,3] [,4]
  # [1,]    1    1   NA    1
  # [2,]    2    2    2    2
  # [3,]    3    3    3    3
  # [4,]    4    4    4    4

# m matrix의 행의 합, 열의 합 출력
colSums(m) #10 10 NA 10
rowSums(m) #NA  8 12 16

# m matrix의 행의 합, 열의 합 출력(결측값 제외)
colSums(m, na.rm=T) # 10 10 9 10
rowSums(m, na.rm=T) # 3  8 12 16

# m matrix의 행의 평균, 열의 합 출력
colMeans(m, na.rm=T) # 2.5 2.5 3.0 2.5
rowMeans(m, na.rm=T) # 1 2 3 4
